================================================================================
Line comment
================================================================================

// this is a comment
hello

--------------------------------------------------------------------------------

(document
  (line_comment)
  (entry
    (atom
      (scalar
        (bare_scalar)))))

================================================================================
Comment after entry
================================================================================

hello // inline comment

--------------------------------------------------------------------------------

(document
  (entry
    (atom
      (scalar
        (bare_scalar))))
  (line_comment))

================================================================================
Doc comment
================================================================================

/// This documents the entry
hello

--------------------------------------------------------------------------------

(document
  (doc_comment)
  (entry
    (atom
      (scalar
        (bare_scalar)))))

================================================================================
Multi-line doc comment
================================================================================

/// Line one
/// Line two
/// Line three
value

--------------------------------------------------------------------------------

(document
  (doc_comment)
  (entry
    (atom
      (scalar
        (bare_scalar)))))
