================================================================================
Single atom entry (implicit unit value)
================================================================================

{
    enabled
}

--------------------------------------------------------------------------------

(document
  (entry
    (value
      payload: (object
        (entry
          (value
            payload: (scalar
              (bare_scalar))))))))

================================================================================
Two atom entry (key value)
================================================================================

{
    host localhost
}

--------------------------------------------------------------------------------

(document
  (entry
    (value
      payload: (object
        (entry
          (value
            payload: (scalar
              (bare_scalar)))
          (value
            payload: (scalar
              (bare_scalar))))))))

================================================================================
Three atom entry (nested key path)
================================================================================

{
    server host localhost
}

--------------------------------------------------------------------------------

(document
  (entry
    (value
      payload: (object
        (entry
          (value
            payload: (scalar
              (bare_scalar)))
          (value
            payload: (scalar
              (bare_scalar)))
          (value
            payload: (scalar
              (bare_scalar))))))))

================================================================================
Entry with tag as value
================================================================================

{
    status @ok
}

--------------------------------------------------------------------------------

(document
  (entry
    (value
      payload: (object
        (entry
          (value
            payload: (scalar
              (bare_scalar)))
          (value
            tag: (tag)))))))

================================================================================
Entry with unit as explicit value
================================================================================

{
    optional @
}

--------------------------------------------------------------------------------

(document
  (entry
    (value
      payload: (object
        (entry
          (value
            payload: (scalar
              (bare_scalar)))
          (value
            payload: (unit)))))))

================================================================================
Top-level entries (implicit root object)
================================================================================

host localhost
port 8080

--------------------------------------------------------------------------------

(document
  (entry
    (value
      payload: (scalar
        (bare_scalar)))
    (value
      payload: (scalar
        (bare_scalar))))
  (entry
    (value
      payload: (scalar
        (bare_scalar)))
    (value
      payload: (scalar
        (bare_scalar)))))
