================================================================================
Single atom entry (implicit unit value)
================================================================================

{
    enabled
}

--------------------------------------------------------------------------------

(document
  (entry
    (atom
      (object
        (entry
          (atom
            (scalar
              (bare_scalar))))))))

================================================================================
Two atom entry (key value)
================================================================================

{
    host localhost
}

--------------------------------------------------------------------------------

(document
  (entry
    (atom
      (object
        (entry
          (atom
            (scalar
              (bare_scalar)))
          (atom
            (scalar
              (bare_scalar))))))))

================================================================================
Three atom entry (nested key path)
================================================================================

{
    server host localhost
}

--------------------------------------------------------------------------------

(document
  (entry
    (atom
      (object
        (entry
          (atom
            (scalar
              (bare_scalar)))
          (atom
            (scalar
              (bare_scalar)))
          (atom
            (scalar
              (bare_scalar))))))))

================================================================================
Entry with tag as value
================================================================================

{
    status @ok
}

--------------------------------------------------------------------------------

(document
  (entry
    (atom
      (object
        (entry
          (atom
            (scalar
              (bare_scalar)))
          (atom
            (tag)))))))

================================================================================
Entry with unit as explicit value
================================================================================

{
    optional @
}

--------------------------------------------------------------------------------

(document
  (entry
    (atom
      (object
        (entry
          (atom
            (scalar
              (bare_scalar)))
          (atom
            (unit)))))))

================================================================================
Top-level entries (implicit root object)
================================================================================

host localhost
port 8080

--------------------------------------------------------------------------------

(document
  (entry
    (atom
      (scalar
        (bare_scalar)))
    (atom
      (scalar
        (bare_scalar))))
  (entry
    (atom
      (scalar
        (bare_scalar)))
    (atom
      (scalar
        (bare_scalar)))))
