================================================================================
Empty object
================================================================================

{}

--------------------------------------------------------------------------------

(document
  (entry
    key: (expr
      payload: (object))))

================================================================================
Object with single entry
================================================================================

{
    key value
}

--------------------------------------------------------------------------------

(document
  (entry
    key: (expr
      payload: (object
        (entry
          key: (expr
            payload: (scalar
              (bare_scalar)))
          value: (expr
            payload: (scalar
              (bare_scalar))))))))

================================================================================
Object with multiple entries newline separated
================================================================================

{
    host localhost
    port 8080
}

--------------------------------------------------------------------------------

(document
  (entry
    key: (expr
      payload: (object
        (entry
          key: (expr
            payload: (scalar
              (bare_scalar)))
          value: (expr
            payload: (scalar
              (bare_scalar))))
        (entry
          key: (expr
            payload: (scalar
              (bare_scalar)))
          value: (expr
            payload: (scalar
              (bare_scalar))))))))

================================================================================
Object with comma separated entries
================================================================================

{host localhost, port 8080}

--------------------------------------------------------------------------------

(document
  (entry
    key: (expr
      payload: (object
        (entry
          key: (expr
            payload: (scalar
              (bare_scalar)))
          value: (expr
            payload: (scalar
              (bare_scalar))))
        (entry
          key: (expr
            payload: (scalar
              (bare_scalar)))
          value: (expr
            payload: (scalar
              (bare_scalar))))))))

================================================================================
Nested objects
================================================================================

{
    server {
        host localhost
        port 8080
    }
}

--------------------------------------------------------------------------------

(document
  (entry
    key: (expr
      payload: (object
        (entry
          key: (expr
            payload: (scalar
              (bare_scalar)))
          value: (expr
            payload: (object
              (entry
                key: (expr
                  payload: (scalar
                    (bare_scalar)))
                value: (expr
                  payload: (scalar
                    (bare_scalar))))
              (entry
                key: (expr
                  payload: (scalar
                    (bare_scalar)))
                value: (expr
                  payload: (scalar
                    (bare_scalar)))))))))))

================================================================================
Object with implicit unit value
================================================================================

{
    enabled
    debug
}

--------------------------------------------------------------------------------

(document
  (entry
    key: (expr
      payload: (object
        (entry
          key: (expr
            payload: (scalar
              (bare_scalar))))
        (entry
          key: (expr
            payload: (scalar
              (bare_scalar))))))))
