================================================================================
Empty sequence
================================================================================

()

--------------------------------------------------------------------------------

(document
  (entry
    (atom
      (sequence))))

================================================================================
Sequence with scalars
================================================================================

(a b c)

--------------------------------------------------------------------------------

(document
  (entry
    (atom
      (sequence
        (atom
          (scalar
            (bare_scalar)))
        (atom
          (scalar
            (bare_scalar)))
        (atom
          (scalar
            (bare_scalar)))))))

================================================================================
Sequence with mixed content
================================================================================

(hello "world" 42)

--------------------------------------------------------------------------------

(document
  (entry
    (atom
      (sequence
        (atom
          (scalar
            (bare_scalar)))
        (atom
          (scalar
            (quoted_scalar)))
        (atom
          (scalar
            (bare_scalar)))))))

================================================================================
Nested sequences
================================================================================

((a b) (c d))

--------------------------------------------------------------------------------

(document
  (entry
    (atom
      (sequence
        (atom
          (sequence
            (atom
              (scalar
                (bare_scalar)))
            (atom
              (scalar
                (bare_scalar)))))
        (atom
          (sequence
            (atom
              (scalar
                (bare_scalar)))
            (atom
              (scalar
                (bare_scalar)))))))))

================================================================================
Sequence with objects
================================================================================

({name alice} {name bob})

--------------------------------------------------------------------------------

(document
  (entry
    (atom
      (sequence
        (atom
          (object
            (entry
              (atom
                (scalar
                  (bare_scalar)))
              (atom
                (scalar
                  (bare_scalar))))))
        (atom
          (object
            (entry
              (atom
                (scalar
                  (bare_scalar)))
              (atom
                (scalar
                  (bare_scalar))))))))))
