================================================================================
Empty sequence
================================================================================

()

--------------------------------------------------------------------------------

(document
  (entry
    (value
      payload: (sequence))))

================================================================================
Sequence with scalars
================================================================================

(a b c)

--------------------------------------------------------------------------------

(document
  (entry
    (value
      payload: (sequence
        (value
          payload: (scalar
            (bare_scalar)))
        (value
          payload: (scalar
            (bare_scalar)))
        (value
          payload: (scalar
            (bare_scalar)))))))

================================================================================
Sequence with mixed content
================================================================================

(hello "world" 42)

--------------------------------------------------------------------------------

(document
  (entry
    (value
      payload: (sequence
        (value
          payload: (scalar
            (bare_scalar)))
        (value
          payload: (scalar
            (quoted_scalar)))
        (value
          payload: (scalar
            (bare_scalar)))))))

================================================================================
Nested sequences
================================================================================

((a b) (c d))

--------------------------------------------------------------------------------

(document
  (entry
    (value
      payload: (sequence
        (value
          payload: (sequence
            (value
              payload: (scalar
                (bare_scalar)))
            (value
              payload: (scalar
                (bare_scalar)))))
        (value
          payload: (sequence
            (value
              payload: (scalar
                (bare_scalar)))
            (value
              payload: (scalar
                (bare_scalar)))))))))

================================================================================
Sequence with objects
================================================================================

({name alice} {name bob})

--------------------------------------------------------------------------------

(document
  (entry
    (value
      payload: (sequence
        (value
          payload: (object
            (entry
              (value
                payload: (scalar
                  (bare_scalar)))
              (value
                payload: (scalar
                  (bare_scalar))))))
        (value
          payload: (object
            (entry
              (value
                payload: (scalar
                  (bare_scalar)))
              (value
                payload: (scalar
                  (bare_scalar))))))))))
