================================================================================
Empty sequence
================================================================================

()

--------------------------------------------------------------------------------

(document
  (entry
    key: (expr
      payload: (sequence))))

================================================================================
Sequence with scalars
================================================================================

(a b c)

--------------------------------------------------------------------------------

(document
  (entry
    key: (expr
      payload: (sequence
        (expr
          payload: (scalar
            (bare_scalar)))
        (expr
          payload: (scalar
            (bare_scalar)))
        (expr
          payload: (scalar
            (bare_scalar)))))))

================================================================================
Sequence with mixed content
================================================================================

(hello "world" 42)

--------------------------------------------------------------------------------

(document
  (entry
    key: (expr
      payload: (sequence
        (expr
          payload: (scalar
            (bare_scalar)))
        (expr
          payload: (scalar
            (quoted_scalar)))
        (expr
          payload: (scalar
            (bare_scalar)))))))

================================================================================
Nested sequences
================================================================================

((a b) (c d))

--------------------------------------------------------------------------------

(document
  (entry
    key: (expr
      payload: (sequence
        (expr
          payload: (sequence
            (expr
              payload: (scalar
                (bare_scalar)))
            (expr
              payload: (scalar
                (bare_scalar)))))
        (expr
          payload: (sequence
            (expr
              payload: (scalar
                (bare_scalar)))
            (expr
              payload: (scalar
                (bare_scalar)))))))))

================================================================================
Sequence with objects
================================================================================

({name alice} {name bob})

--------------------------------------------------------------------------------

(document
  (entry
    key: (expr
      payload: (sequence
        (expr
          payload: (object
            (entry
              key: (expr
                payload: (scalar
                  (bare_scalar)))
              value: (expr
                payload: (scalar
                  (bare_scalar))))))
        (expr
          payload: (object
            (entry
              key: (expr
                payload: (scalar
                  (bare_scalar)))
              value: (expr
                payload: (scalar
                  (bare_scalar))))))))))
