================================================================================
Unit value
================================================================================

@

--------------------------------------------------------------------------------

(document
  (entry
    (atom
      (unit))))

================================================================================
Simple tag (unit variant)
================================================================================

@ok

--------------------------------------------------------------------------------

(document
  (entry
    (atom
      (tag))))

================================================================================
Tag with explicit unit payload
================================================================================

@none@

--------------------------------------------------------------------------------

(document
  (entry
    (atom
      (tag
        (tag_payload
          (unit))))))

================================================================================
Tag with quoted scalar payload
================================================================================

@error"something went wrong"

--------------------------------------------------------------------------------

(document
  (entry
    (atom
      (tag
        (tag_payload
          (quoted_scalar))))))

================================================================================
Tag with object payload
================================================================================

@error{code 500, message "oops"}

--------------------------------------------------------------------------------

(document
  (entry
    (atom
      (tag
        (tag_payload
          (object
            (entry
              (atom
                (scalar
                  (bare_scalar)))
              (atom
                (scalar
                  (bare_scalar))))
            (entry
              (atom
                (scalar
                  (bare_scalar)))
              (atom
                (scalar
                  (quoted_scalar))))))))))

================================================================================
Tag with sequence payload
================================================================================

@point(10 20 30)

--------------------------------------------------------------------------------

(document
  (entry
    (atom
      (tag
        (tag_payload
          (sequence
            (atom
              (scalar
                (bare_scalar)))
            (atom
              (scalar
                (bare_scalar)))
            (atom
              (scalar
                (bare_scalar)))))))))

================================================================================
Tag with dots and dashes in name
================================================================================

@my-custom.tag

--------------------------------------------------------------------------------

(document
  (entry
    (atom
      (tag))))
