================================================================================
Unit value
================================================================================

@

--------------------------------------------------------------------------------

(document
  (entry
    (value
      payload: (unit))))

================================================================================
Simple tag (unit variant)
================================================================================

@ok

--------------------------------------------------------------------------------

(document
  (entry
    (value
      tag: (tag))))

================================================================================
Tag with explicit unit payload
================================================================================

@none@

--------------------------------------------------------------------------------

(document
  (entry
    (value
      tag: (tag)
      payload: (unit))))

================================================================================
Tag with quoted scalar payload
================================================================================

@error"something went wrong"

--------------------------------------------------------------------------------

(document
  (entry
    (value
      tag: (tag)
      payload: (scalar
        (quoted_scalar)))))

================================================================================
Tag with object payload
================================================================================

@error{code 500, message "oops"}

--------------------------------------------------------------------------------

(document
  (entry
    (value
      tag: (tag)
      payload: (object
        (entry
          (value
            payload: (scalar
              (bare_scalar)))
          (value
            payload: (scalar
              (bare_scalar))))
        (entry
          (value
            payload: (scalar
              (bare_scalar)))
          (value
            payload: (scalar
              (quoted_scalar))))))))

================================================================================
Tag with sequence payload
================================================================================

@point(10 20 30)

--------------------------------------------------------------------------------

(document
  (entry
    (value
      tag: (tag)
      payload: (sequence
        (value
          payload: (scalar
            (bare_scalar)))
        (value
          payload: (scalar
            (bare_scalar)))
        (value
          payload: (scalar
            (bare_scalar)))))))

================================================================================
Tag with dots and dashes in name
================================================================================

@my-custom.tag

--------------------------------------------------------------------------------

(document
  (entry
    (value
      tag: (tag))))
